In [2]:
import pandas as pd

# Dataframe in Pandas

In [5]:
data_dict = {'names':['vikas','akash','kaash','raash'],
            'marks':[50,55,20,30],
            'salary':[100,200,150,105]}
data_dict

{'names': ['vikas', 'akash', 'kaash', 'raash'],
 'marks': [50, 55, 20, 30],
 'salary': [100, 200, 150, 105]}

In [6]:
data = pd.DataFrame(data_dict)
data

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

## Changing the index column

In [8]:
data.set_index('names',inplace=True) # 'inplace=True' helps to make the new changes saved to orignal data 
data

       marks  salary
names
vikas     50     100
akash     55     200
kaash     20     150
raash     30     105

## First five rows

In [11]:
data.head() # head(100) will return first 100 rows

       marks  salary
names
vikas     50     100
akash     55     200
kaash     20     150
raash     30     105

## Last five rows

In [10]:
data.tail()

       marks  salary
names
vikas     50     100
akash     55     200
kaash     20     150
raash     30     105

In [12]:
data.head(2)

       marks  salary
names
vikas     50     100
akash     55     200

# Creating column

In [16]:
heights = [110,230,140,150]
data['heights'] = heights
data

       marks  salary  heights
names
vikas     50     100      110
akash     55     200      230
kaash     20     150      140
raash     30     105      150

# Deleting column

In [17]:
del data['heights']

In [18]:
data

       marks  salary
names
vikas     50     100
akash     55     200
kaash     20     150
raash     30     105

# Transposing data

In [19]:
data.T

names   vikas  akash  kaash  raash
marks      50     55     20     30
salary    100    200    150    105

In [22]:
data.columns

Index(['marks', 'salary'], dtype='object')

In [26]:
data.index

Index(['vikas', 'akash', 'kaash', 'raash'], dtype='object', name='names')